Revit 2024 API
SpecTypeId.PipingPressure Property
 Pressure, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipingPressure { get; }
Visual Basic
Public Shared ReadOnly Property PipingPressure As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipingPressure {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace